Repository: MerdanDev/personal_budget
Catalog: lib/l10n/arb/app_*.arb
Languages: tk

source: A long time ago
tk: Öňden bäri ýok

source: Add
tk: Goşmak

# addFriendsFromContact
source: Let's add friends from your contacts
tk: Kontaktlaryňyzdan dostlaryňyzy goşalyň.

source: ago
tk: öň

# alreadyExposed
source: Not recommended
tk: Maslahat berilmeýär

# areSureToQuitBody
source: You will need to login to your account to continue your progress.
tk: Bäsleşikleri dowam etmek üçin, siz hasabyňyza täzeden girmeli bolarsyňyz.

# areSureToQuitTitle
source: Are your sure to logout?
tk: Çyndanam çykmagy isleýärsiňizmi?

source: Audio
tk: Ses.hab.

source: Audio message
tk: Audio

source: Authorization
tk: Ulgama girmek

# avatarWasUploaded
source: A new avatar has been uploaded successfully
tk: Täze awatar üstünlikli ýüklenildi

source: Back
tk: Yza

source: Back up
tk: Ätiýaçlyk nusga

# backend_code
source: en
tk: tk

# bio
source: I am ...
tk: Men ...

# bioBody
source: What makes you special? Don't think too much, just have fun with it.
tk: Sizi näme tapawutlandyrýar? Kän bir uly ýazgy gerek däl diňe göwnüňizden çykanyny ýazyň

# bioTitle
source: Write about yourself
tk: Özüňiz barada ýazyň

# birthdayBody
source: Use your birthday even if the account is for a business, pet, or anything else. No one will see it unless you choose to share it.
tk: Iş hasaby, haýwan ýa-da başga bir zat üçin bolsa-da, doglan günüňizi ulanyň. Paýlaşmagy saýlamasaňyz hiç kim görmez.

# birthdayHint
source: Select date
tk: Senäni saýlaň

# birthdayTitle
source: When is your birthday?
tk: Doglan günüňiz haçan?

source: Calendar
tk: Senenama

source: Call
tk: Jaň etmek

source: Cancel
tk: Ýatyrmak

source: Candle chart
tk: Şem grafy

source: Categories
tk: Kategoriýalar

source: Change banner
tk: Bannery çalyşmak

# changeImage
source: Change photo
tk: Surady üýtgetmek

source: Charts
tk: Graflar

source: Chat
tk: Gürleşik

source: Choose from gallery
tk: Galeriýadan saýlamak

source: Choose photo
tk: Surady saýlamak

# chooseProfilePhoto
source: Choose a photo
tk: Surat saýlaň

source: Color
tk: Reňk

source: Confirm
tk: Tassyklamak

source: Confirmation
tk: Tassyklamak

source: Confirmation code
tk: Tassyklanyş kody

source: Connecting
tk: Baglanylýar

# connectionErrorOccurred
source: Connection can't be established
tk: Baglanyşyk amala aşyrylmady

# contactPermissionDenied
source: You have not given permission for reading contacts, press again to retry
tk: Kontaktlary okamaga rugsat bermediňiz, gaýtadan synanyşmak üçin gaýtadan basyň

source: Contacts
tk: Kontaktlar

# continueT
source: Continue
tk: Dowam etmek

# copiedToClipboard
source: Text was copied to clipboard
tk: Hat ýada göçürildi

source: Copy
tk: Göçürmek

source: Counter
tk: Hasaplaýjy

source: day
tk: gün

source: Delete
tk: Öçürmek

# deleteForAll
source: Also delete for {name}
tk: Şeýle hem {name} üçin pozuň

source: Delete message
tk: Habary öçürmek

# deleteMessageContent
source: Are you sure you want to delete this message?
tk: Siz hakykatdanam öçürmek isleýärsiňizmi?

# deleteTitle
source: Do you want to delete
tk: Öçürmek isleýärsiňizmi?

source: Description
tk: Düşündiriş

source: Edit
tk: Üýtgetmek

source: Edit profile
tk: Maglumaty üýtgetmek

# emailShort
source: Email
tk: Elektron poçta

source: Empty
tk: Boş

# enterConfirmationCode
source: Enter the 5-digit code sent to the {number}
tk: {number} belgä iberilen 5 sanly kody giriziň

# errorOccurred
source: Something went wrong. Please, try again.
tk: Ýalňyş ýüze çykdy. Täzeden synanşyp görüň.

# fileMessageType
source: File message
tk: Faýl

source: Files
tk: Faýllar

# forgetPassword
source: Forgot password
tk: Açar sözüni täzele

source: Forward
tk: Ugratmak

# haveNotRegistered
source: Don't have an account?
tk: Hasap ýokmy?

# haveRegistered
source: Already have an account?
tk: Hasabyňyz barmy?

source: Home
tk: Esasy

source: hour
tk: sagat

source: Icon
tk: Nyşan

source: Image message
tk: Surat

source: Income
tk: Girdeji

# inputAgreeTerms
source: I agree to all the terms and conditions
tk: Men düzgünleriň ählisini kabul edýärin

# inputEmail
source: Email
tk: Elektron poçta

# inputEmailInstruction
source: Enter your email address
tk: Elektron poçta salgyňyzy giriziň

# inputEmailInvalid
source: Invalid email format
tk: Girizen elektron poçtaňyzyň formady nädogry

# inputEmptyInvalid
source: The field must not be empty
tk: Boş goýulmaly däl

# inputFamilyName
source: Family name
tk: Familiýaňyz

# inputFamilyNameInstruction
source: Enter your Family name
tk: Familiýaňyzy giriziň

# inputName
source: Name
tk: Ady

# inputNameInstruction
source: Enter your name
tk: Adyňyzy giriziň

# inputNick
source: Nickname
tk: Ulanyjy ady

# inputNickInstruction
source: Enter your nickname
tk: Ulanyjy adyny giriziň

# inputPhone
source: Phone
tk: Telefon belgisi

# inputPhoneInstruction
source: Enter your phone number
tk: Telefon belgiňizi giriziň

# inputPhoneInvalid
source: Invalid phone format
tk: Girizen telefon belgiňiziň formady nädogry

# label
source: English
tk: Türkmen

# languageSettings
source: Language
tk: Dil

source: Location
tk: Ýerleşýän ýeri

source: Location message
tk: Ýerleşýän ýer

source: Login
tk: Girmek

# loginBody
source: Enter the phone number and password you used to register
tk: Hasaba almak üçin ulanan telefon belgiňizi we parolyňyzy giriziň

# logoutProfile
source: Sign out
tk: Çykmak

source: Map
tk: Karta

source: Medium
tk: Ortaça

source: minute
tk: minut

source: month
tk: aý

# moreDetails
source: Show details
tk: Giňişleýin

source: Mute
tk: Sessiz

# nameBody
source: You can always change your name later
tk: Siz ulanyjy adyny soň üýtgedip bilýärsiňiz

# nameHint
source: Enter your name and surname
tk: Adyňyzy we familiýaňyzy giriziň

# nameTitle
source: What is your name?
tk: Siziň adyňyz näme?

# nickBody
source: For unique way to find your account, you can always change this later
tk: Bu ýekeräk ulanyjy ady sizi beýlekilerden tapawutlandyrmak we tapmak üçin niýetlenen, buny soň hem çalşyp bilersiňiz/

# nickTitle
source: Choose a unique username
tk: Ýeketäk ulanyjy adyny aýlaň

source: No
tk: Ýok

source: Now
tk: Şu wagt

source: online
tk: ulgamda

# pass
source: Next
tk: Geç

source: Password
tk: Açar sözi

source: Password confirmation
tk: Açar sözini tassyklamak

# passwordConfirmationInstruction
source: Enter your password confirmation
tk: Açyr söziniň tassyklamasyny giriziň

# passwordInstruction
source: Enter your password
tk: Açar sözüni giriziň

# passwordNotSame
source: Password and it's confirmation must be same and don't forget your password
tk: Açar sözi we ony tassyklanyşy meňzeş däl we açar sözüni ýatdan çykaraýmaň

# passwordTitle
source: Create a strong password
tk: Berk açar sözini saýlaň

# phoneShort
source: Phone
tk: Telefon

source: Photo
tk: Surat

# photoBody
source: Add a photo so your friends can recognize you
tk: Dostlaryňyz sizi tanar ýaly surady saýlaň

# photoTitle
source: Profile photo
tk: Ulanyjy surady

source: Poster
tk: Afişa

source: Posts
tk: Paýlaşmalar

source: Privacy Policy
tk: Gizlinlik syýasatynda görüň

source: Profile
tk: Profil

# profileWasUpdated
source: Your profile information has been updated successfully
tk: Siziň maglumatyňyz üstünlikli üýtgedildi

source: Radial chart
tk: Radial diagramma

# reacted
source: Reacted to message
tk: Habardan täsirlendi

# refreshError
source: Refresh
tk: Täzele

source: Register
tk: Hasaba almak

# registerBody
source: To register, you must enter a phone number
tk: Hasaba alynmak üçin telefon belgisini girizmeli

source: Registration
tk: Hasaba alyş

source: Remember me
tk: Ýatda sakla

source: Reply
tk: Jogap bermek

# resendOtp
source: Resend a code
tk: Kody täzeden iber

# resendOtpAfter
source: Resend a code after {time}
tk: {time} wagtdan kody täzeden iber

source: Restore back up
tk: Ätiýaçlyk nusgasyny dikelt

# save_success
source: Successfully saved:
tk: Üstünlik bilen ýatda saklandy:

source: Search
tk: Gözleg

source: second
tk: sekund

source: Secure
tk: Howpsuz

source: Select language
tk: Dil saýlaň

# select_output_file
source: Please select an output file:
tk: Çykaryş faýly saýlaň:

source: Send location
tk: Ýerleşýän ýeri ugratmak

# sendLocationOnline
source: Send live location
tk: Onlaýn ýagdaýda ýerleşýän ýeri ugratmak

# sendOtp
source: Send code
tk: Kody iber

source: Settings
tk: Sazlamalar

source: Skip
tk: Dowam etmek

source: Strong
tk: Güýçli

source: Subscribe to friends
tk: Dostlaryňyza ýazylyň

source: Subscribers
tk: Ýazylanlar

source: Subscriptions
tk: Ýazylanlarym

source: Tags
tk: Birikdirme

# takePhoto
source: Take a photo
tk: Surata düşürmek

source: Title
tk: Sözbaşy

source: Today
tk: Şu gün

source: Unsupported message type
tk: Goldanmaýan hat görnüşi

source: Urls
tk: URL

source: User agreement
tk: Ulanyjy şertnamasy

# userTimeStatus
source: was online {time}
tk: {time} ulgamdady

source: Verify phone number
tk: Telefon belgisini tassyklamak

source: Video
tk: Wideo

source: Video call
tk: Wideo jaň

source: Video message
tk: Wideo

source: Weak
tk: Gowşak

# welcomeBody
source: Sync your contacts to add friends and view their stories.
tk: Aragatnaşyk sanawy bilen dost goşuň we olaryň paýlaşanlaryny görüň

# welcomeInfo
source: Your contacts and related information will be sent to Alaja to improve your experience and allow you and others to find friends. Find out more in our
tk: Aragatnaşyklaryňyz we degişli maglumatlaryňyz, tejribäňizi ýokarlandyrmak we size we başgalara dost tapmaga mümkinçilik bermek üçin Alaja iberiler. Bu barada has giňişleýin maglumaty

# welcomeTitle
source: Welcome
tk: Hoş geldiňiz

source: Write message
tk: Hat ýazmak

source: year
tk: ýyl

source: Yes
tk: Hawa

source: Yesterday
tk: Düýn
